# IFCTransaction Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCTransaction Methods
IFCTransaction Class See Also
---
The IFCTransaction type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Commit | Commits all changes made to the IFC file during the transaction. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| RollBack | Rolls back all changes made to the IFC file during the transaction. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace